#pragma once
#include "./unit/unit.hpp"
#include "prism/common.hpp"
#include "token.hpp"

#pragma pack( push, 1 )

namespace ets2_la_plugin::prism
{
    // Size: 0x21E8 1.55
    class game_actor_u : public /* [0x10] @ 0x00 */ unit_t
    {
    public:
        char pad_0010[ 8 ];                                             // 0x0010 (0x08)
        class game_physics_vehicle_u* game_physics_vehicle;             // 0x0018 (0x08)
        class visual_interior_u* visual_interior;                       // 0x0020 (0x08)
        class game_actor_hud_u* game_actor_hud;                         // 0x0028 (0x08)
        char pad_0030[ 112 ];                                           // 0x0030 (0x70)
        class history_stream_set_u* history_stream_set;                 // 0x00A0 (0x08)
        char pad_00A8[ 16 ];                                            // 0x00A8 (0x10)
        class history_manager_u* history_manager;                       // 0x00B8 (0x08)
        char pad_00C0[ 96 ];                                            // 0x00C0 (0x60)
        uint32_t current_camera;                                        // 0x0120 (0x04)
        char pad_0124[ 8 ];                                             // 0x0124 (0x08)
        uint32_t engine_state;                                          // 0x012C (0x04)
        bool ignition;                                                  // 0x0130 (0x01)
        char pad_0131[ 7 ];                                             // 0x0131 (0x07)
        bool parking_brake;                                             // 0x0138 (0x01)
        char pad_0139[ 9 ];                                             // 0x0139 (0x09)
        bool engine_brake_enabled;                                      // 0x0142 (0x01)
        char pad_0143[ 25 ];                                            // 0x0143 (0x19)
        uint32_t retarder_i_level;                                      // 0x015C (0x04)
        float retarder_f_level;                                         // 0x0160 (0x04)
        char pad_0164[ 4 ];                                             // 0x0164 (0x04)
        bool diff_locked;                                               // 0x0168 (0x01)
        char pad_0169[ 12 ];                                            // 0x0169 (0x0c)
        bool cruise_control_enabled;                                    // 0x0175 (0x01)
        char pad_0176[ 2 ];                                             // 0x0176 (0x02)
        float cruise_control_speed;                                     // 0x0178 (0x04)
        char pad_017C[ 28 ];                                            // 0x017C (0x1c)
        uint32_t wiper_setting;                                         // 0x0198 (0x04)
        char pad_019C[ 24 ];                                            // 0x019C (0x18)
        uint16_t flags;                                                 // 0x01B4 (0x02)
        char pad_01B6[ 2 ];                                             // 0x01B6 (0x02)
        uint16_t additional_illumination;                               // 0x01B8 (0x02)
        char pad_01BA[ 14 ];                                            // 0x01BA (0x0e)
        float wipers_intermittent_time;                                 // 0x01C8 (0x04)
        float wipers_position;                                          // 0x01CC (0x04)
        float rpm;                                                      // 0x01D0 (0x04)
        float air_pressure;                                             // 0x01D4 (0x04)
        float brake_pressure;                                           // 0x01D8 (0x04)
        float max_air_pressure;                                         // 0x01DC (0x04)
        char pad_01E0[ 8 ];                                             // 0x01E0 (0x08)
        float oil_temp;                                                 // 0x01E8 (0x04)
        char pad_01EC[ 4 ];                                             // 0x01EC (0x04)
        float water_temp;                                               // 0x01F0 (0x04)
        char pad_01F4[ 4 ];                                             // 0x01F4 (0x04)
        float battery_voltage;                                          // 0x01F8 (0x04)
        char pad_01FC[ 8 ];                                             // 0x01FC (0x08)
        float turbo_pressure;                                           // 0x0204 (0x04)
        char pad_0208[ 16 ];                                            // 0x0208 (0x10)
        float light_switch;                                             // 0x0218 (0x04)
        float light_switch_state;                                       // 0x021C (0x04)
        float high_beam_stick;                                          // 0x0220 (0x04)
        float high_beam_state;                                          // 0x0224 (0x04)
        float light_horn_stick;                                         // 0x0228 (0x04)
        float light_horn_state;                                         // 0x022C (0x04)
        float indicator_stick;                                          // 0x0230 (0x04)
        float indicator_state;                                          // 0x0234 (0x04)
        float hazard_warning_btn;                                       // 0x0238 (0x04)
        float hazard_warning_state;                                     // 0x023C (0x04)
        float beacon_switch;                                            // 0x0240 (0x04)
        float beacon_state;                                             // 0x0244 (0x04)
        char pad_0248[ 8 ];                                             // 0x0248 (0x08)
        float handbrake_handle;                                         // 0x0250 (0x04)
        float handbrake_state;                                          // 0x0254 (0x04)
        char pad_0258[ 16 ];                                            // 0x0258 (0x10)
        float engine_brake_stick;                                       // 0x0268 (0x04)
        float engine_brake_state;                                       // 0x026C (0x04)
        char pad_0270[ 20 ];                                            // 0x0270 (0x14)
        float wipers_stick;                                             // 0x0284 (0x04)
        float wipers_state;                                             // 0x0288 (0x04)
        char pad_028C[ 20 ];                                            // 0x028C (0x14)
        uint8_t left_window_moving_direction;                           // 0x02A0 (0x01)
        uint8_t is_left_window_moving;                                  // 0x02A1 (0x01)
        char pad_02A2[ 2 ];                                             // 0x02A2 (0x02)
        float left_window_state;                                        // 0x02A4 (0x04)
        float left_window_btn;                                          // 0x02A8 (0x04)
        float left_window_btn_state;                                    // 0x02AC (0x04)
        char pad_02B0[ 8 ];                                             // 0x02B0 (0x08)
        uint8_t right_window_moving_direction;                          // 0x02B8 (0x01)
        uint8_t is_right_window_moving;                                 // 0x02B9 (0x01)
        char pad_02BA[ 2 ];                                             // 0x02BA (0x02)
        float right_window_state;                                       // 0x02BC (0x04)
        float right_window_btn;                                         // 0x02C0 (0x04)
        float right_window_btn_state;                                   // 0x02C4 (0x04)
        char pad_02C8[ 6232 ];                                          // 0x02C8 (0x1858)
        class sound_player_truck_t* sound_player_truck;                 // 0x1B20 (0x08)
        char pad_1B28[ 40 ];                                            // 0x1B28 (0x28)
        float rpm2;                                                     // 0x1B50 (0x04)
        float some_throttle_value;                                      // 0x1B54 (0x04)
        char pad_1B58[ 12 ];                                            // 0x1B58 (0x0c)
        float ro_throttle_input;                                        // 0x1B64 (0x04)
        float ro_brake_input;                                           // 0x1B68 (0x04)
        float ro_clutch_input;                                          // 0x1B6C (0x04)
        char pad_1B70[ 4 ];                                             // 0x1B70 (0x04)
        float ro_steering_input;                                        // 0x1B74 (0x04)
        char pad_1B78[ 8 ];                                             // 0x1B78 (0x08)
        float N000094A4;                                                // 0x1B80 (0x04)
        char pad_1B84[ 4 ];                                             // 0x1B84 (0x04)
        float N000094A5;                                                // 0x1B88 (0x04)
        float N0000BF38;                                                // 0x1B8C (0x04)
        placement_t placement;                                          // 0x1B90 (0x20)
        class model_object_u* driver_model;                             // 0x1BB0 (0x08)
        char pad_1BB8[ 16 ];                                            // 0x1BB8 (0x10)
        class physics_gearbox_sequential_u* physics_gearbox_sequential; // 0x1BC8 (0x08)
        class physics_gearbox_automatic_u* physics_gearbox_automatic;   // 0x1BD0 (0x08)
        class physics_gearbox_direct_u* physics_gearbox_direct;         // 0x1BD8 (0x08)
        char pad_1BE0[ 8 ];                                             // 0x1BE0 (0x08)
        class accessory_head_lights_data_u* accessory_head_lights_data; // 0x1BE8 (0x08)
        char pad_1BF0[ 1528 ];                                          // 0x1BF0 (0x5f8)

        static uint32_t steering_input_offset;
        static uint32_t throttle_input_offset;
        static uint32_t brake_input_offset;

        static bool scan_patterns();
        static game_actor_u* get();
        void set_throttle_input( float value );
        void set_brake_input( float value );
    };
    static_assert( sizeof( game_actor_u ) == 0x21E8 );
}

#pragma pack( pop )
